AmrGaber1/Register-file-definition-for-Atmega32/Python def Automate/sfr_defs_23_09_20_21_13_56.h
/*==========================================================================================
Name        : sfr_defs_update.h
Author      : Amr Gaber
Description : C Header file for the Atmega32
Date        : 20/09/2023
============================================================================================\*/
#ifndef SFR_DEFS_H_
#define SFR_DEFS_H_

typedef unsigned char uint8;
/*Register: SREG*/
typedef union{
	uint8 Byte;
	struct{
		uint8 C :1;
		uint8 Z :1;
		uint8 N :1;
		uint8 V :1;
		uint8 S :1;
		uint8 H :1;
		uint8 T :1;
		uint8 I :1;
	}Bits;
}SREG_reg_type;
/*SREG Address Access Macro*/
#define SREG_REG      (*(volatile SREG_reg_type * const)0x3F)
/*SREG Bit Position Macros*/
#define _SREG_C_POSITION      0x0
#define _SREG_Z_POSITION      0x1
#define _SREG_N_POSITION      0x2
#define _SREG_V_POSITION      0x3
#define _SREG_S_POSITION      0x4
#define _SREG_H_POSITION      0x5
#define _SREG_T_POSITION      0x6
#define _SREG_I_POSITION      0x7
/*SREG Bit mask Macros*/
#define _SREG_C_MASK          0x1
#define _SREG_Z_MASK          0x2
#define _SREG_N_MASK          0x4
#define _SREG_V_MASK          0x8
#define _SREG_S_MASK          0x10
#define _SREG_H_MASK          0x20
#define _SREG_T_MASK          0x40
#define _SREG_I_MASK          0x80


/*Register: SPH*/
typedef union{
	uint8 Byte;
	struct{
		uint8 SP8 :1;
		uint8 SP9 :1;
		uint8 SP10 :1;
		uint8 SP11 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
	}Bits;
}SPH_reg_type;
/*SPH Address Access Macro*/
#define SPH_REG      (*(volatile SPH_reg_type * const)0x3E)
/*SPH Bit Position Macros*/
#define _SPH_SP8_POSITION     0x0
#define _SPH_SP9_POSITION     0x1
#define _SPH_SP10_POSITION    0x2
#define _SPH_SP11_POSITION    0x3
/*SPH Bit mask Macros*/
#define _SPH_SP8_MASK         0x1
#define _SPH_SP9_MASK         0x2
#define _SPH_SP10_MASK        0x4
#define _SPH_SP11_MASK        0x8


/*Register: SPL*/
typedef union{
	uint8 Byte;
	struct{
		uint8 SP0 :1;
		uint8 SP1 :1;
		uint8 SP2 :1;
		uint8 SP3 :1;
		uint8 SP4 :1;
		uint8 SP5 :1;
		uint8 SP6 :1;
		uint8 SP7 :1;
	}Bits;
}SPL_reg_type;
/*SPL Address Access Macro*/
#define SPL_REG      (*(volatile SPL_reg_type * const)0x3D)
/*SPL Bit Position Macros*/
#define _SPL_SP0_POSITION     0x0
#define _SPL_SP1_POSITION     0x1
#define _SPL_SP2_POSITION     0x2
#define _SPL_SP3_POSITION     0x3
#define _SPL_SP4_POSITION     0x4
#define _SPL_SP5_POSITION     0x5
#define _SPL_SP6_POSITION     0x6
#define _SPL_SP7_POSITION     0x7
/*SPL Bit mask Macros*/
#define _SPL_SP0_MASK         0x1
#define _SPL_SP1_MASK         0x2
#define _SPL_SP2_MASK         0x4
#define _SPL_SP3_MASK         0x8
#define _SPL_SP4_MASK         0x10
#define _SPL_SP5_MASK         0x20
#define _SPL_SP6_MASK         0x40
#define _SPL_SP7_MASK         0x80


/*Register: GICR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 IVCE :1;
		uint8 IVSEL :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 INT2 :1;
		uint8 INT0 :1;
		uint8 INT1 :1;
	}Bits;
}GICR_reg_type;
/*GICR Address Access Macro*/
#define GICR_REG      (*(volatile GICR_reg_type * const)0x3B)
/*GICR Bit Position Macros*/
#define _GICR_IVCE_POSITION   0x0
#define _GICR_IVSEL_POSITION  0x1
#define _GICR_INT2_POSITION   0x5
#define _GICR_INT0_POSITION   0x6
#define _GICR_INT1_POSITION   0x7
/*GICR Bit mask Macros*/
#define _GICR_IVCE_MASK       0x1
#define _GICR_IVSEL_MASK      0x2
#define _GICR_INT2_MASK       0x20
#define _GICR_INT0_MASK       0x40
#define _GICR_INT1_MASK       0x80


/*Register: GIFR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 INTF2 :1;
		uint8 INTF0 :1;
		uint8 INTF1 :1;
	}Bits;
}GIFR_reg_type;
/*GIFR Address Access Macro*/
#define GIFR_REG      (*(volatile GIFR_reg_type * const)0x3A)
/*GIFR Bit Position Macros*/
#define _GIFR_INTF2_POSITION  0x5
#define _GIFR_INTF0_POSITION  0x6
#define _GIFR_INTF1_POSITION  0x7
/*GIFR Bit mask Macros*/
#define _GIFR_INTF2_MASK      0x20
#define _GIFR_INTF0_MASK      0x40
#define _GIFR_INTF1_MASK      0x80


/*Register: TIMSK*/
typedef union{
	uint8 Byte;
	struct{
		uint8 TOIE0 :1;
		uint8 OCIE0 :1;
		uint8 TOIE1 :1;
		uint8 OCIE1B :1;
		uint8 OCIE1A :1;
		uint8 TICIE1 :1;
		uint8 TOIE2 :1;
		uint8 OCIE2 :1;
	}Bits;
}TIMSK_reg_type;
/*TIMSK Address Access Macro*/
#define TIMSK_REG      (*(volatile TIMSK_reg_type * const)0x39)
/*TIMSK Bit Position Macros*/
#define _TIMSK_TOIE0_POSITION 0x0
#define _TIMSK_OCIE0_POSITION 0x1
#define _TIMSK_TOIE1_POSITION 0x2
#define _TIMSK_OCIE1B_POSITION0x3
#define _TIMSK_OCIE1A_POSITION0x4
#define _TIMSK_TICIE1_POSITION0x5
#define _TIMSK_TOIE2_POSITION 0x6
#define _TIMSK_OCIE2_POSITION 0x7
/*TIMSK Bit mask Macros*/
#define _TIMSK_TOIE0_MASK     0x1
#define _TIMSK_OCIE0_MASK     0x2
#define _TIMSK_TOIE1_MASK     0x4
#define _TIMSK_OCIE1B_MASK    0x8
#define _TIMSK_OCIE1A_MASK    0x10
#define _TIMSK_TICIE1_MASK    0x20
#define _TIMSK_TOIE2_MASK     0x40
#define _TIMSK_OCIE2_MASK     0x80


/*Register: TIFR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 TOV0 :1;
		uint8 OCF0 :1;
		uint8 TOV1 :1;
		uint8 OCF1B :1;
		uint8 OCF1A :1;
		uint8 ICF1 :1;
		uint8 TOV2 :1;
		uint8 OCF2 :1;
	}Bits;
}TIFR_reg_type;
/*TIFR Address Access Macro*/
#define TIFR_REG      (*(volatile TIFR_reg_type * const)0x38)
/*TIFR Bit Position Macros*/
#define _TIFR_TOV0_POSITION   0x0
#define _TIFR_OCF0_POSITION   0x1
#define _TIFR_TOV1_POSITION   0x2
#define _TIFR_OCF1B_POSITION  0x3
#define _TIFR_OCF1A_POSITION  0x4
#define _TIFR_ICF1_POSITION   0x5
#define _TIFR_TOV2_POSITION   0x6
#define _TIFR_OCF2_POSITION   0x7
/*TIFR Bit mask Macros*/
#define _TIFR_TOV0_MASK       0x1
#define _TIFR_OCF0_MASK       0x2
#define _TIFR_TOV1_MASK       0x4
#define _TIFR_OCF1B_MASK      0x8
#define _TIFR_OCF1A_MASK      0x10
#define _TIFR_ICF1_MASK       0x20
#define _TIFR_TOV2_MASK       0x40
#define _TIFR_OCF2_MASK       0x80


