AmrGaber1/Register-file-definition-for-Atmega32/Python def Automate/sfr_defs_23_09_20_21_13_56.h
/*TCCR1B Address Access Macro*/
#define TCCR1B_REG      (*(volatile TCCR1B_reg_type * const)0x2E)
/*TCCR1B Bit Position Macros*/
#define _TCCR1B_CS10_POSITION 0x0
#define _TCCR1B_CS11_POSITION 0x1
#define _TCCR1B_CS12_POSITION 0x2
#define _TCCR1B_WGM12_POSITION0x3
#define _TCCR1B_WGM13_POSITION0x4
#define _TCCR1B_ICES1_POSITION0x6
#define _TCCR1B_ICNC1_POSITION0x7
/*TCCR1B Bit mask Macros*/
#define _TCCR1B_CS10_MASK     0x1
#define _TCCR1B_CS11_MASK     0x2
#define _TCCR1B_CS12_MASK     0x4
#define _TCCR1B_WGM12_MASK    0x8
#define _TCCR1B_WGM13_MASK    0x10
#define _TCCR1B_ICES1_MASK    0x40
#define _TCCR1B_ICNC1_MASK    0x80


/*Register: TCCR2*/
typedef union{
	uint8 Byte;
	struct{
		uint8 CS20 :1;
		uint8 CS21 :1;
		uint8 CS22 :1;
		uint8 WGM21 :1;
		uint8 COM20 :1;
		uint8 COM21 :1;
		uint8 WGM20 :1;
		uint8 FOC2 :1;
	}Bits;
}TCCR2_reg_type;
/*TCCR2 Address Access Macro*/
#define TCCR2_REG      (*(volatile TCCR2_reg_type * const)0x25)
/*TCCR2 Bit Position Macros*/
#define _TCCR2_CS20_POSITION  0x0
#define _TCCR2_CS21_POSITION  0x1
#define _TCCR2_CS22_POSITION  0x2
#define _TCCR2_WGM21_POSITION 0x3
#define _TCCR2_COM20_POSITION 0x4
#define _TCCR2_COM21_POSITION 0x5
#define _TCCR2_WGM20_POSITION 0x6
#define _TCCR2_FOC2_POSITION  0x7
/*TCCR2 Bit mask Macros*/
#define _TCCR2_CS20_MASK      0x1
#define _TCCR2_CS21_MASK      0x2
#define _TCCR2_CS22_MASK      0x4
#define _TCCR2_WGM21_MASK     0x8
#define _TCCR2_COM20_MASK     0x10
#define _TCCR2_COM21_MASK     0x20
#define _TCCR2_WGM20_MASK     0x40
#define _TCCR2_FOC2_MASK      0x80


/*Register: ASSR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 TCR2UB :1;
		uint8 OCR2UB :1;
		uint8 TCN2UB :1;
		uint8 AS2 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
	}Bits;
}ASSR_reg_type;
/*ASSR Address Access Macro*/
#define ASSR_REG      (*(volatile ASSR_reg_type * const)0x22)
/*ASSR Bit Position Macros*/
#define _ASSR_TCR2UB_POSITION 0x0
#define _ASSR_OCR2UB_POSITION 0x1
#define _ASSR_TCN2UB_POSITION 0x2
#define _ASSR_AS2_POSITION    0x3
/*ASSR Bit mask Macros*/
#define _ASSR_TCR2UB_MASK     0x1
#define _ASSR_OCR2UB_MASK     0x2
#define _ASSR_TCN2UB_MASK     0x4
#define _ASSR_AS2_MASK        0x8


/*Register: WDTCR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 WDP0 :1;
		uint8 WDP1 :1;
		uint8 WDP2 :1;
		uint8 WDE :1;
		uint8 WDTOE :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
	}Bits;
}WDTCR_reg_type;
/*WDTCR Address Access Macro*/
#define WDTCR_REG      (*(volatile WDTCR_reg_type * const)0x21)
/*WDTCR Bit Position Macros*/
#define _WDTCR_WDP0_POSITION  0x0
#define _WDTCR_WDP1_POSITION  0x1
#define _WDTCR_WDP2_POSITION  0x2
#define _WDTCR_WDE_POSITION   0x3
#define _WDTCR_WDTOE_POSITION 0x4
/*WDTCR Bit mask Macros*/
#define _WDTCR_WDP0_MASK      0x1
#define _WDTCR_WDP1_MASK      0x2
#define _WDTCR_WDP2_MASK      0x4
#define _WDTCR_WDE_MASK       0x8
#define _WDTCR_WDTOE_MASK     0x10


/*Register: UBRRH*/
typedef union{
	uint8 Byte;
	struct{
		uint8 UBRR8 :1;
		uint8 UBRR9 :1;
		uint8 UBRR10 :1;
		uint8 UBRR11 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 URSEL :1;
	}Bits;
}UBRRH_reg_type;
/*UBRRH Address Access Macro*/
#define UBRRH_REG      (*(volatile UBRRH_reg_type * const)0x20)
/*UBRRH Bit Position Macros*/
#define _UBRRH_UBRR8_POSITION 0x0
#define _UBRRH_UBRR9_POSITION 0x1
#define _UBRRH_UBRR10_POSITION0x2
#define _UBRRH_UBRR11_POSITION0x3
#define _UBRRH_URSEL_POSITION 0x7
/*UBRRH Bit mask Macros*/
#define _UBRRH_UBRR8_MASK     0x1
#define _UBRRH_UBRR9_MASK     0x2
#define _UBRRH_UBRR10_MASK    0x4
#define _UBRRH_UBRR11_MASK    0x8
#define _UBRRH_URSEL_MASK     0x80


/*Register: UCSRC*/
typedef union{
	uint8 Byte;
	struct{
		uint8 UCPOL :1;
		uint8 UCSZ0 :1;
		uint8 UCSZ1 :1;
		uint8 USBS :1;
		uint8 UPM0 :1;
		uint8 UPM1 :1;
		uint8 UMSEL :1;
		uint8 URSEL :1;
	}Bits;
}UCSRC_reg_type;
/*UCSRC Address Access Macro*/
#define UCSRC_REG      (*(volatile UCSRC_reg_type * const)0x20)
/*UCSRC Bit Position Macros*/
#define _UCSRC_UCPOL_POSITION 0x0
#define _UCSRC_UCSZ0_POSITION 0x1
#define _UCSRC_UCSZ1_POSITION 0x2
#define _UCSRC_USBS_POSITION  0x3
#define _UCSRC_UPM0_POSITION  0x4
#define _UCSRC_UPM1_POSITION  0x5
#define _UCSRC_UMSEL_POSITION 0x6
#define _UCSRC_URSEL_POSITION 0x7
/*UCSRC Bit mask Macros*/
#define _UCSRC_UCPOL_MASK     0x1
#define _UCSRC_UCSZ0_MASK     0x2
#define _UCSRC_UCSZ1_MASK     0x4
#define _UCSRC_USBS_MASK      0x8
#define _UCSRC_UPM0_MASK      0x10
#define _UCSRC_UPM1_MASK      0x20
#define _UCSRC_UMSEL_MASK     0x40
#define _UCSRC_URSEL_MASK     0x80


/*Register: EEARH*/
typedef union{
	uint8 Byte;
	struct{
		uint8 EEAR8 :1;
		uint8 EEAR9 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
	}Bits;
}EEARH_reg_type;
/*EEARH Address Access Macro*/
#define EEARH_REG      (*(volatile EEARH_reg_type * const)0x1F)
/*EEARH Bit Position Macros*/
#define _EEARH_EEAR8_POSITION 0x0
#define _EEARH_EEAR9_POSITION 0x1
/*EEARH Bit mask Macros*/
#define _EEARH_EEAR8_MASK     0x1
#define _EEARH_EEAR9_MASK     0x2


/*Register: EECR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 EERE :1;
		uint8 EEWE :1;
		uint8 EEMWE :1;
		uint8 EERIE :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
	}Bits;
}EECR_reg_type;
/*EECR Address Access Macro*/
#define EECR_REG      (*(volatile EECR_reg_type * const)0x1C)
/*EECR Bit Position Macros*/
#define _EECR_EERE_POSITION   0x0
#define _EECR_EEWE_POSITION   0x1
#define _EECR_EEMWE_POSITION  0x2
#define _EECR_EERIE_POSITION  0x3
/*EECR Bit mask Macros*/
#define _EECR_EERE_MASK       0x1
#define _EECR_EEWE_MASK       0x2
#define _EECR_EEMWE_MASK      0x4
#define _EECR_EERIE_MASK      0x8


/*Register: PORTA*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PINA0 :1;
		uint8 PINA1 :1;
		uint8 PINA2 :1;
		uint8 PINA3 :1;
		uint8 PINA4 :1;
		uint8 PINA5 :1;
		uint8 PINA6 :1;
		uint8 PINA7 :1;
	}Bits;
}PORTA_reg_type;
/*PORTA Address Access Macro*/
#define PORTA_REG      (*(volatile PORTA_reg_type * const)0x1B)
/*PORTA Bit Position Macros*/
#define _PORTA_PINA0_POSITION 0x0
#define _PORTA_PINA1_POSITION 0x1
#define _PORTA_PINA2_POSITION 0x2
#define _PORTA_PINA3_POSITION 0x3
#define _PORTA_PINA4_POSITION 0x4
#define _PORTA_PINA5_POSITION 0x5
#define _PORTA_PINA6_POSITION 0x6
#define _PORTA_PINA7_POSITION 0x7
/*PORTA Bit mask Macros*/
#define _PORTA_PINA0_MASK     0x1
#define _PORTA_PINA1_MASK     0x2
#define _PORTA_PINA2_MASK     0x4
#define _PORTA_PINA3_MASK     0x8
#define _PORTA_PINA4_MASK     0x10
#define _PORTA_PINA5_MASK     0x20
#define _PORTA_PINA6_MASK     0x40
#define _PORTA_PINA7_MASK     0x80


/*Register: DDRA*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PINA0 :1;
		uint8 PINA1 :1;
		uint8 PINA2 :1;
		uint8 PINA3 :1;
		uint8 PINA4 :1;
		uint8 PINA5 :1;
		uint8 PINA6 :1;
		uint8 PINA7 :1;
	}Bits;
}DDRA_reg_type;
/*DDRA Address Access Macro*/
#define DDRA_REG      (*(volatile DDRA_reg_type * const)0x1A)
/*DDRA Bit Position Macros*/
#define _DDRA_PINA0_POSITION  0x0
#define _DDRA_PINA1_POSITION  0x1
#define _DDRA_PINA2_POSITION  0x2
#define _DDRA_PINA3_POSITION  0x3
#define _DDRA_PINA4_POSITION  0x4
#define _DDRA_PINA5_POSITION  0x5
#define _DDRA_PINA6_POSITION  0x6
#define _DDRA_PINA7_POSITION  0x7
/*DDRA Bit mask Macros*/
#define _DDRA_PINA0_MASK      0x1
#define _DDRA_PINA1_MASK      0x2
#define _DDRA_PINA2_MASK      0x4
#define _DDRA_PINA3_MASK      0x8
#define _DDRA_PINA4_MASK      0x10
#define _DDRA_PINA5_MASK      0x20
#define _DDRA_PINA6_MASK      0x40
#define _DDRA_PINA7_MASK      0x80


/*Register: PINA*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PINA0 :1;
		uint8 PINA1 :1;
		uint8 PINA2 :1;
		uint8 PINA3 :1;
		uint8 PINA4 :1;
		uint8 PINA5 :1;
		uint8 PINA6 :1;
		uint8 PINA7 :1;
	}Bits;
}PINA_reg_type;
/*PINA Address Access Macro*/
#define PINA_REG      (*(volatile PINA_reg_type * const)0x19)
/*PINA Bit Position Macros*/
#define _PINA_PINA0_POSITION  0x0
#define _PINA_PINA1_POSITION  0x1
#define _PINA_PINA2_POSITION  0x2
#define _PINA_PINA3_POSITION  0x3
#define _PINA_PINA4_POSITION  0x4
#define _PINA_PINA5_POSITION  0x5
#define _PINA_PINA6_POSITION  0x6
#define _PINA_PINA7_POSITION  0x7
/*PINA Bit mask Macros*/
#define _PINA_PINA0_MASK      0x1
#define _PINA_PINA1_MASK      0x2
#define _PINA_PINA2_MASK      0x4
#define _PINA_PINA3_MASK      0x8
#define _PINA_PINA4_MASK      0x10
#define _PINA_PINA5_MASK      0x20
#define _PINA_PINA6_MASK      0x40
#define _PINA_PINA7_MASK      0x80


/*Register: PORTB*/
typedef union{
	uint8 Byte;
	struct{
		uint8 PINB0 :1;
		uint8 PINB1 :1;
		uint8 PINB2 :1;
		uint8 PINB3 :1;
		uint8 PINB4 :1;
		uint8 PINB5 :1;
		uint8 PINB6 :1;
		uint8 PINB7 :1;
	}Bits;
}PORTB_reg_type;
/*PORTB Address Access Macro*/
#define PORTB_REG      (*(volatile PORTB_reg_type * const)0x18)
/*PORTB Bit Position Macros*/
#define _PORTB_PINB0_POSITION 0x0
#define _PORTB_PINB1_POSITION 0x1
#define _PORTB_PINB2_POSITION 0x2
#define _PORTB_PINB3_POSITION 0x3
#define _PORTB_PINB4_POSITION 0x4
#define _PORTB_PINB5_POSITION 0x5
#define _PORTB_PINB6_POSITION 0x6
#define _PORTB_PINB7_POSITION 0x7
/*PORTB Bit mask Macros*/
#define _PORTB_PINB0_MASK     0x1
#define _PORTB_PINB1_MASK     0x2
#define _PORTB_PINB2_MASK     0x4
#define _PORTB_PINB3_MASK     0x8
#define _PORTB_PINB4_MASK     0x10
#define _PORTB_PINB5_MASK     0x20
#define _PORTB_PINB6_MASK     0x40
#define _PORTB_PINB7_MASK     0x80


